/*************************************************************************

*************************************************************************/

#include"delay.h"

/***********************
函数功能：us延时
输入参数：无
输出参数：无
备    注：粗略延时 1us
***********************/
void delay_us(void)
{ 
    asm("nop"); //一个asm("nop")函数经过示波器测试代表125ns
    asm("nop");
    asm("nop");
    asm("nop"); 
    asm("nop");
    asm("nop"); 
    asm("nop");
    asm("nop"); 	
}

/***********************
函数功能：ms延时
输入参数：无
输出参数：无
备    注：粗略延时1ms
***********************/
void delay_ms(unsigned int time)
{
    unsigned int i;
    while(time--)  
    for(i=500;i>0;i--)
    delay_us(); 
}
